### 1. Loading the Dataset

In [3]:
import pandas as pd
import matplotlib.pyplot as plt
import seaborn as sns
import numpy as np

%matplotlib inline

df = pd.read_csv("df_final_experiment_clients.txt", sep=",")

In [2]:
df

       client_id Variation
0        9988021      Test
1        8320017      Test
2        4033851   Control
3        1982004      Test
4        9294070   Control
...          ...       ...
70604    2443347       NaN
70605    8788427       NaN
70606     266828       NaN
70607    1266421       NaN
70608    9895983       NaN

[70609 rows x 2 columns]

### 2. Cleaning names of columns

In [4]:
df.columns = df.columns.str.lower()

In [5]:
df.head(5)

   client_id variation
0    9988021      Test
1    8320017      Test
2    4033851   Control
3    1982004      Test
4    9294070   Control

- client_id: every client’s unique ID.
- variation: indicates if a client was part of the experiment.

### 3. Cleaning Data

In [6]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 70609 entries, 0 to 70608
Data columns (total 2 columns):
 #   Column     Non-Null Count  Dtype
---  ------     --------------  -----
 0   client_id  70609 non-null  int64
 1   variation  50500 non-null  object
dtypes: int64(1), object(1)
memory usage: 1.1+ MB

In [7]:
df.isnull().sum()

client_id        0
variation    20109
dtype: int64

In [8]:
df['variation'].unique()

array(['Test', 'Control', nan], dtype=object)

df['variation'].value_counts()

In [11]:
df['variation'].value_counts(dropna=False)

variation
Test       26968
Control    23532
NaN        20109
Name: count, dtype: int64

As our objective is to compare Test vs Control behavoiur, we are going to drop all rows without variation assignment.

In [13]:
df_exp = df[df['variation'].notna()]
df_exp

       client_id variation
0        9988021      Test
1        8320017      Test
2        4033851   Control
3        1982004      Test
4        9294070   Control
...          ...       ...
50495     393005   Control
50496    2908510   Control
50497    7230446      Test
50498    5230357      Test
50499    6334360      Test

[50500 rows x 2 columns]

### 4. Checking duplicated values

In [14]:
df.duplicated().sum()

np.int64(0)

**Maybe we should change variation variable to boolean.**

### 5. Exporting the clean DataFrame

In [15]:
df.to_csv("experiment_clean.csv", index=False, encoding='utf-8')